-- 万能传送系统内核

x990001_ChuansongList = {}
x990001_ChuansongList[1] = 
{
	{"洛阳商会",0,234,132,10},	{"大理驿站",2,241,141,10},	{"苏州驿站",1,113,161,10},	{"苏州铁匠",1,236,128,10},
	{"楼兰古城",186,288,136,75},{"束河古镇",420,200,211,30},{"星宿",16,96,152,10},		{"逍遥",14,67,145,10},
	{"少林",9,95,137,10},		{"天山",17,95,120,10},		{"天龙",13,96,120,10},		{"峨嵋",15,89,144,10},
	{"武当",12,103,140,10},		{"明教",11,98,167,10},		{"丐帮",10,91,116,10},		{"大理新手技能",2,160,135,10},	
}

x990001_ChuansongList[2] = 
{
	{"宝藏洞第1层",123,233,228,10},	{"宝藏洞第3层",148,18,230,10},	{"宝藏洞第5层",150,128,238,10},	{"魔崖洞",170,26,216,10},
	{"古墓第1层",159,68,95,30},		{"古墓第5层",163,24,24,30},		{"古墓第9层",167,20,18,30},		{"地宫第1层",400,227,226,60},
	{"地宫第2层",401,223,225,60},	{"地宫第3层",402,231,218,60},	{"高昌迷宫",520,100,99,90},		{"塔克拉玛干",427,38,24,90},
	{"汗血岭",432,90,86,90},		{"火焰谷",519,71,29,90},		{"无量山",6,43,172,10},			{"敦煌",8,276,145,10},
}

x990001_ChuansongList[3] = 
{
	{"草原小白",20,278,255,30},		{"苍山金刚",25,277,53,30},		{"武夷冰妖",32,43,40,30},		{"玄武蛤蟆",39,91,32,10},
	{"雪原企鹅王",188,83,37,30},	{"工魂影像",170,216,176,30},	{"丐帮孙立者",140,44,38,30},	{"峨嵋袁公子",145,46,40,30},
	{"明教金裳",141,98,60,30},		{"少林彭侯",139,46,41,30},		{"星宿三十娘",146,142,54,30},	{"天山白岑",147,93,39,30},
	{"武当孟昧",142,88,52,30},		{"逍遥贾川",144,140,41,30},		{"天龙王君",143,95,35,30},
}

x990001_ChuansongList[4] = 
{
	{"老三环",1,62,162,10},		{"新三环",186,293,71,75},		{"珍珑棋局",1,174,146,10},		{"蹴鞠",0,198,58,10},
	{"燕子坞",4,74,122,30},		{"缥缈峰",186,190,222,75},		{"楼兰寻宝",186,161,82,75},
	
}
x990001_ChuansongList[5] = 
{
	{"圣兽山龙龟",158,170,30,30},		{"圣兽山箱子",158,139,122,30},		{"暴走霜影",420,282,125,30},
}			

function x990001_Teleport(sceneId, selfId, nType, Index)
	if sceneId > 2 then
		x990001_NotifyTip( sceneId, selfId, "万能传送只能在主城内使用!" )
		return
	end
    if x990001_ChuansongList[nType] == nil then 
		return
	end
	local toOhter = x990001_ChuansongList[nType][Index]
	if toOhter == nil then 
		return
	end
	CallScriptFunction( (400900), "TransferFunc",sceneId,selfId,toOhter[2],toOhter[3],toOhter[4],toOhter[5])
end

function x990001_NotifyTip( sceneId, selfId, Msg )
	BeginEvent( sceneId )
		AddText( sceneId, Msg )
	EndEvent( sceneId )
	DispatchMissionTips( sceneId, selfId )
end